Incorporating Other Languages into Python.org
#+TITLE: Incorporating Other Languages into Python
#+AUTHOR: Joey Bernard
#+OPTIONS: H:1 toc:nil
#+LATEX_CLASS: beamer
#+STARTUP: showall
#+BEAMER_THEME: Madrid


** Land Acknowledgement
:PROPERTIES:
:CUSTOM_ID: land-acknowledgement
:END:
We respectfully acknowledge that UNB stands on the unsurrendered and unceded traditional Wolastoqey (WOOL-US-TOOK-WAY) land. The lands of Wabanaki (WAH-BAH-NAH-KEE) people are recognized in a series of Peace and Friendship Treaties to establish an ongoing relationship of peace, friendship and mutual respect between equal nations. The river that runs by our university is known as Wolastoq (WOOL-LUSS-TOOK), along which live Wolastoqiyik (WOOL-US-TOO-GWEEG) - the people of the beautiful and bountiful river. Wolastoq (WOOL-LUSS-TOOK) is also called the St. John River.

** Introduction
:PROPERTIES:
:CUSTOM_ID: introduction
:END:
- Python has become the default glue language for science
- It is not ideal for all cases
- We will look at how to offload issues to another language

** Installation
:PROPERTIES:
:CUSTOM_ID: installation
:END:
- We need several tools
- Almost everything we will discuss involves C/C++
- You will need Python plus a C/C+ compiler
- All of this work should be done in a virtual environment (now
  necessary under Ubuntu)

** Software Options
:PROPERTIES:
:CUSTOM_ID: software-options
:END:
- Most Linux distributions will have everything you need in their
  package management system
- For Windows, you can use WSL to get a Linux environment
- You can also use scoop (https://scoop.sh) to install Windows developer
  tools
- For Apple Macs, you can use homebrew (https://brew.sh) to do the same
  thing

** Pre-existing Examples
:PROPERTIES:
:CUSTOM_ID: pre-existing-examples
:END:
- Several of the high performance libraries already do this
- numpy uses C, C++ and FORTRAN (in order of usage)
- scipy uses C, FORTRAN and C++ (in order of usage)

** Why do this
:PROPERTIES:
:CUSTOM_ID: why-do-this
:END:
- Python is an object oriented language, without static typing
- This means loops can be horrendous
- Also have the GIL, throttling multi-process work (this is currently being worked on)

** Virtual Environments
:PROPERTIES:
:CUSTOM_ID: virtual-environments
:END:

- The first step is creating a virtual environment

#+begin_src sh
python -m venv python_project1
#+end_src

- This creates a new directory for your project
- You can activate it with

#+begin_src sh
cd ./python_project1
. ./bin/activate
#+end_src

- When you are done, you can simply run the command

#+begin_src sh
deactivate
#+end_src

** First step - Numba
:PROPERTIES:
:CUSTOM_ID: first-step---numba
:END:
- In some cases, you just need a slightly faster Python
- Whenever you try to optimize, remember the quote - */Early
  optimization is the root of all evil/*
- You want to do the bare minimum to get the results that you actually
  need
- Numba allows for compiling portions of your Python code

** Numba - installation
:PROPERTIES:
:CUSTOM_ID: numba---installation
:END:

- Numba is installed using the command

#+begin_src sh
pip install numba
#+end_src

- This will install the numba module, along with llvmlite
- This why you should use virtual environments - to keep your projects
  clean and isolated

** Numba - cont'd
:PROPERTIES:
:CUSTOM_ID: numba---contd
:END:
- Numba uses decorators to encapsulate your code
- The most common decorator is =@jit=
- This decorator has loads of options, including whether to parallelize
  or whether to target a GPU

** Numba - options
:PROPERTIES:
:CUSTOM_ID: numba---options
:END:
- */nogil/* - whether to release the GIL when entering the compiled code
- */cache/* - whether to save off compiled code into a file cache to
  avoid the compiling step each time
- */parallel/* - whether to parallelize compiled code when possible
  (e.g. loops)
- */fastmath/* - whether to use strict IEEE 754 math (similar to the GCC
  flag)

** Numba - explicit typing
:PROPERTIES:
:CUSTOM_ID: numba---explicit-typing
:END:

- One issue with Python is that variables are untyped
- You can assign a type signature as part of the jit decorator
- For example

#+begin_src python
from numba import jit

@jit(int32(int32,int32))
def my_func(val1, val2):
    return val1 + val2
#+end_src

- This allows numba to know what the data types are and to compile away
  the usual checks that Python has to do

** Numba - usage
:PROPERTIES:
:CUSTOM_ID: numba---usage
:END:

- Compiling your code is as easy as

#+begin_src sh
numba my_code.py
#+end_src

- You can also output debugging information with options like

#+begin_src sh
numba my_code.py --annotate
OR
numba my_code.py --dump_llvm
#+end_src

** Numba - numpy universal functions
:PROPERTIES:
:CUSTOM_ID: numba---numpy-universal-functions
:END:
- You can create numpy ufuncs by decorating your Python code
- For scalar input arguments, using the \textit{@vectorize}
  decorator for your function
- For data structures, you can use the \textit{@guvectorize}
  decorator
- While you could just use the \textit{@jit} decorator with an
  iteration loop, but this method adds in the numpy features, like
  reduction, accumulation or broadcasting

** Numba - numpy example
:PROPERTIES:
:CUSTOM_ID: numba---numpy-example
:END:
#+begin_src python
from numba import vectorize, float64

@vectorize([float64(float64, float64)])
def f(x, y):
    return x + y
#+end_src

** Numba - AOT compilation
:PROPERTIES:
:CUSTOM_ID: numba---aot-compilation
:END:
- Usually numba compiles code at run-time
- You can pre-compile your code before having to use it
- This allows you to distribute the code to users who may not have numba
  installed

** Numba - AOT example
:PROPERTIES:
:CUSTOM_ID: numba---aot-example
:END:
#+begin_src python
from numba.pycc import CC
cc = CC('my_module')

@cc.export('multf', 'f8(f8, f8)')
@cc.export('multi', 'i4(i4, i4)')
def mult(a, b):
    return a * b

@cc.export('square', 'f8(f8)')
def square(a):
    return a ** 2

if __name__ == "__main__":
    cc.compile()
#+end_src

** Numba - AOT compiling
:PROPERTIES:
:CUSTOM_ID: numba---aot-compiling
:END:
- Running the above script generates a shared library that contains the
  compiled code
- This won't work for numpy ufuncs
- Exported functions don't check argument types
- AOT produces generic architecture code, while JIT produces specific
  code

** Numba - jit\textunderscore module
:PROPERTIES:
:CUSTOM_ID: numba---jit_module
:END:
- In some cases, you may have an entire module worth of code that you
  want to pass through numba's JIT
  - You can use the \textit{jit\textunderscore module()} function within your module code to
    apply the changes, rather than having decorate every function
    individually
- Any functions that you do decorate will use those options, rather than
  the module level options

** Next step - Cython
:PROPERTIES:
:CUSTOM_ID: next-step---cython
:END:
- Cython allows for adding C/C++ data types, and outputting compiled
  code
- You need to annotate your code in order to tell Cython what is
  expected
- You will need to have your own C/C++ compiler - ideally the same as
  the compiler used for Python
- This becomes easy to mess up under Windows - consider strongly using
  WSL

