Incorporating Other Languages into Python.tex
% Created 2026-05-13 Wed 20:28
% Intended LaTeX compiler: pdflatex
\documentclass[presentation]{beamer}

\usepackage[utf8]{inputenc}
\usepackage[T1]{fontenc}
\usepackage{graphicx}
\usepackage{longtable}
\usepackage{wrapfig}
\usepackage{rotating}
\usepackage[normalem]{ulem}
\usepackage{amsmath}
\usepackage{amssymb}
\usepackage{capt-of}
\usepackage{hyperref}
\usetheme{Madrid}
\author{Joey Bernard}
\date{\today}
\title{Incorporating Other Languages into Python}
\hypersetup{
 pdfauthor={Joey Bernard},
 pdftitle={Incorporating Other Languages into Python},
 pdfkeywords={},
 pdfsubject={},
 pdfcreator={},
 pdflang={English}}
\begin{document}

\maketitle
\begin{frame}[label=land-acknowledgement]{Land Acknowledgement}
We respectfully acknowledge that UNB stands on the unsurrendered and unceded traditional Wolastoqey (WOOL-US-TOOK-WAY) land. The lands of Wabanaki (WAH-BAH-NAH-KEE) people are recognized in a series of Peace and Friendship Treaties to establish an ongoing relationship of peace, friendship and mutual respect between equal nations. The river that runs by our university is known as Wolastoq (WOOL-LUSS-TOOK), along which live Wolastoqiyik (WOOL-US-TOO-GWEEG) - the people of the beautiful and bountiful river. Wolastoq (WOOL-LUSS-TOOK) is also called the St. John River.
\end{frame}
\begin{frame}[label=introduction]{Introduction}
\begin{itemize}
\item Python has become the default glue language for science
\item It is not ideal for all cases
\item We will look at how to offload issues to another language
\end{itemize}
\end{frame}
\begin{frame}[label=installation]{Installation}
\begin{itemize}
\item We need several tools
\item Almost everything we will discuss involves C/C++
\item You will need Python plus a C/C+ compiler
\item All of this work should be done in a virtual environment (now
necessary under Ubuntu)
\end{itemize}
\end{frame}
\begin{frame}[label=software-options]{Software Options}
\begin{itemize}
\item Most Linux distributions will have everything you need in their
package management system
\item For Windows, you can use WSL to get a Linux environment
\item You can also use scoop (\url{https://scoop.sh}) to install Windows developer
tools
\item For Apple Macs, you can use homebrew (\url{https://brew.sh}) to do the same
thing
\end{itemize}
\end{frame}
\begin{frame}[label=pre-existing-examples]{Pre-existing Examples}
\begin{itemize}
\item Several of the high performance libraries already do this
\item numpy uses C, C++ and FORTRAN (in order of usage)
\item scipy uses C, FORTRAN and C++ (in order of usage)
\end{itemize}
\end{frame}
\begin{frame}[label=why-do-this]{Why do this}
\begin{itemize}
\item Python is an object oriented language, without static typing
\item This means loops can be horrendous
\item Also have the GIL, throttling multi-process work (this is currently being worked on)
\end{itemize}
\end{frame}
\begin{frame}[label=virtual-environments,fragile]{Virtual Environments}
 \begin{itemize}
\item The first step is creating a virtual environment
\end{itemize}

\begin{verbatim}
python -m venv python_project1
\end{verbatim}

\begin{itemize}
\item This creates a new directory for your project
\item You can activate it with
\end{itemize}

\begin{verbatim}
cd ./python_project1
. ./bin/activate
\end{verbatim}

\begin{itemize}
\item When you are done, you can simply run the command
\end{itemize}

\begin{verbatim}
deactivate
\end{verbatim}
\end{frame}
\begin{frame}[label=first-step---numba]{First step - Numba}
\begin{itemize}
\item In some cases, you just need a slightly faster Python
\item Whenever you try to optimize, remember the quote - \alert{\emph{Early
optimization is the root of all evil}}
\item You want to do the bare minimum to get the results that you actually
need
\item Numba allows for compiling portions of your Python code
\end{itemize}
\end{frame}
\begin{frame}[label=numba---installation,fragile]{Numba - installation}
 \begin{itemize}
\item Numba is installed using the command
\end{itemize}

\begin{verbatim}
pip install numba
\end{verbatim}

\begin{itemize}
\item This will install the numba module, along with llvmlite
\item This why you should use virtual environments - to keep your projects
clean and isolated
\end{itemize}
\end{frame}
\begin{frame}[label=numba---contd,fragile]{Numba - cont'd}
 \begin{itemize}
\item Numba uses decorators to encapsulate your code
\item The most common decorator is \texttt{@jit}
\item This decorator has loads of options, including whether to parallelize
or whether to target a GPU
\end{itemize}
\end{frame}
\begin{frame}[label=numba---options]{Numba - options}
\begin{itemize}
\item \alert{\emph{nogil}} - whether to release the GIL when entering the compiled code
\item \alert{\emph{cache}} - whether to save off compiled code into a file cache to
avoid the compiling step each time
\item \alert{\emph{parallel}} - whether to parallelize compiled code when possible
(e.g. loops)
\item \alert{\emph{fastmath}} - whether to use strict IEEE 754 math (similar to the GCC
flag)
\end{itemize}
\end{frame}
\begin{frame}[label=numba---explicit-typing,fragile]{Numba - explicit typing}
 \begin{itemize}
\item One issue with Python is that variables are untyped
\item You can assign a type signature as part of the jit decorator
\item For example
\end{itemize}

\begin{verbatim}
from numba import jit

@jit(int32(int32,int32))
def my_func(val1, val2):
    return val1 + val2
\end{verbatim}

\begin{itemize}
\item This allows numba to know what the data types are and to compile away
the usual checks that Python has to do
\end{itemize}
\end{frame}
\begin{frame}[label=numba---usage,fragile]{Numba - usage}
 \begin{itemize}
\item Compiling your code is as easy as
\end{itemize}

\begin{verbatim}
numba my_code.py
\end{verbatim}

\begin{itemize}
\item You can also output debugging information with options like
\end{itemize}

\begin{verbatim}
numba my_code.py --annotate
OR
numba my_code.py --dump_llvm
\end{verbatim}
\end{frame}
\begin{frame}[label=numba---numpy-universal-functions]{Numba - numpy universal functions}
\begin{itemize}
\item You can create numpy ufuncs by decorating your Python code
\item For scalar input arguments, using the \textit{@vectorize}
decorator for your function
\item For data structures, you can use the \textit{@guvectorize}
decorator
\item While you could just use the \textit{@jit} decorator with an
iteration loop, but this method adds in the numpy features, like
reduction, accumulation or broadcasting
\end{itemize}
\end{frame}
\begin{frame}[label=numba---numpy-example,fragile]{Numba - numpy example}
 \begin{verbatim}
from numba import vectorize, float64

@vectorize([float64(float64, float64)])
def f(x, y):
    return x + y
\end{verbatim}
\end{frame}
\begin{frame}[label=numba---aot-compilation]{Numba - AOT compilation}
\begin{itemize}
\item Usually numba compiles code at run-time
\item You can pre-compile your code before having to use it
\item This allows you to distribute the code to users who may not have numba
installed
\end{itemize}
\end{frame}
\begin{frame}[label=numba---aot-example,fragile]{Numba - AOT example}
 \begin{verbatim}
from numba.pycc import CC
cc = CC('my_module')

@cc.export('multf', 'f8(f8, f8)')
@cc.export('multi', 'i4(i4, i4)')
def mult(a, b):
    return a * b

@cc.export('square', 'f8(f8)')
def square(a):
    return a ** 2

if __name__ == "__main__":
    cc.compile()
\end{verbatim}
\end{frame}
\begin{frame}[label=numba---aot-compiling]{Numba - AOT compiling}
\begin{itemize}
\item Running the above script generates a shared library that contains the
compiled code
\item This won't work for numpy ufuncs
\item Exported functions don't check argument types
\item AOT produces generic architecture code, while JIT produces specific
code
\end{itemize}
\end{frame}
\begin{frame}[label=numba---jit_module]{Numba - jit\textunderscore module}
\begin{itemize}
\item In some cases, you may have an entire module worth of code that you
want to pass through numba's JIT
\begin{itemize}
\item You can use the \textit{jit\textunderscore module()} function within your module code to
apply the changes, rather than having decorate every function
individually
\end{itemize}
\item Any functions that you do decorate will use those options, rather than
the module level options
\end{itemize}
\end{frame}
\begin{frame}[label=next-step---cython]{Next step - Cython}
\begin{itemize}
\item Cython allows for adding C/C++ data types, and outputting compiled
code
\item You need to annotate your code in order to tell Cython what is
expected
\item You will need to have your own C/C++ compiler - ideally the same as
the compiler used for Python
\item This becomes easy to mess up under Windows - consider strongly using
WSL
\end{itemize}
\end{frame}
