Incorporating Other Languages into Python.org
** Cython - annotation
:PROPERTIES:
:CUSTOM_ID: cython---annotation
:END:

- Cython will compile pure Python
- Using static typing will give a decent initial speedup
- You can annotate so that it looks like

#+begin_src python
import cython

i: cython.int
j: cython.double
#+end_src

** Cython - different notation
:PROPERTIES:
:CUSTOM_ID: cython---different-notation
:END:

Pure Python

#+begin_src python
def primes(nb_primes: cython.int):
    i: cython.int
    p: cython.int[1000]

    if nb_primes > 1000:
        nb_primes = 1000
    # Only if regular Python is running
    if not cython.compiled:
        # Make p work almost like a C array
        p = [0] * 1000

    len_p: cython.int = 0  # The current number of elements in p.
    n: cython.int = 2
    while len_p < nb_primes:
#+end_src

** Cython - different notation continued
Older Cython

#+begin_src python
def primes(int nb_primes):
    cdef int n, i, len_p
    cdef int[1000] p

    if nb_primes > 1000:
        nb_primes = 1000



    # The current number of elements in p.
    len_p = 0
    n = 2
    while len_p < nb_primes:
#+end_src

** Cython - usage
:PROPERTIES:
:CUSTOM_ID: cython---usage
:END:

- The easiest way to build Cython code is to use setuptools

#+begin_src sh
pip install cython
pip install setuptools
#+end_src

- This way, you can use setuptools to build your Cython module
- Files can use endings /.pyx/ or /.py/

** Cython - hello world
:PROPERTIES:
:CUSTOM_ID: cython---hello-world
:END:

- We can start with the classic *Hello World* in the file */hello.pyx/*

#+begin_src python
def say_hello_to(name):
    print(f"Hello {name}!")
#+end_src

** Cython - setuptools
:PROPERTIES:
:CUSTOM_ID: cython---setuptools
:END:

- To build it, we'll need a /setup.py/ script

#+begin_src python
from setuptools import setup
from Cython.Build import cythonize

setup(
    name='Hello World app',
    ext_modules=cythonize("hello.pyx"),
)
#+end_src

** Cython - building
:PROPERTIES:
:CUSTOM_ID: cython---building
:END:

- To build it, you would use the command

#+begin_src sh
python setup.py build_ext --inplace
#+end_src

- Then you can use it with

#+begin_src python
from hello import say_hello_to
#+end_src

** Cython - basics
:PROPERTIES:
:CUSTOM_ID: cython---basics
:END:
- You can call C functions from libraries
- You have the ability to use static types
- Writing Python wrappers allows your Python code to use C libraries
- Your Cython code gets compiled down to C

** Cython - stdlib functions
:PROPERTIES:
:CUSTOM_ID: cython---stdlib-functions
:END:

- You can import and use C functions from the standard library

#+begin_src python
from cython.cimports.libc.stdlib import atoi

@cython.cfunc
def parse_charptr_to_py_int(s: cython.p_char):
    assert s is not cython.NULL, "byte string value is NULL"
    return atoi(s)  # note: atoi() has no error detection!
#+end_src

** Cython - other libraries
:PROPERTIES:
:CUSTOM_ID: cython---other-libraries
:END:
- You can also import from other libraries, e.g.
   - */from cython.cimports.libc.math import sin/*
- Some libraries (like math) are not automatically linked - you will
  have to add linking information to your */setup.py/* file

** Cython - external libraries
:PROPERTIES:
:CUSTOM_ID: cython---external-libraries
:END:
- Using other external libraries isn't quite so seamless
- You will need to write a */.pxd/* file to wrap the details from the
  header file for your external library
- You then will need to write a Python wrapper class to encapsulate the
  calls to the C code

** Cython - cqueue pxd file
:PROPERTIES:
:CUSTOM_ID: cython---cqueue-pxd-file
:END:
#+begin_src python
cdef extern from "c-algorithms/src/queue.h":
    ctypedef struct Queue:
        pass
    ctypedef void* QueueValue
    Queue* queue_new()
    void queue_free(Queue* queue)
    int queue_push_head(Queue* queue, QueueValue data)
    QueueValue  queue_pop_head(Queue* queue)
    QueueValue queue_peek_head(Queue* queue)
    int queue_push_tail(Queue* queue, QueueValue data)
    QueueValue queue_pop_tail(Queue* queue)
    QueueValue queue_peek_tail(Queue* queue)
    bint queue_is_empty(Queue* queue)
#+end_src

** Cython - wrapper class for a queue
:PROPERTIES:
:CUSTOM_ID: cython---wrapper-class-for-a-queue
:END:
#+begin_src python
from cython.cimports import cqueue

@cython.cclass
class Queue:
    _c_queue: cython.pointer[cqueue.Queue]

    def __cinit__(self):
        self._c_queue = cqueue.queue_new()
#+end_src

** Cython - strings
:PROPERTIES:
:CUSTOM_ID: cython---strings
:END:
- Strings prove to be a bit of a mess
- Cython supports 4 types: /bytes/, /str/, /unicode/ and /basestring/
- Involves a decoding/encoding step when going back and forth between
  Python and C

** Cython - memory management
:PROPERTIES:
:CUSTOM_ID: cython---memory-management
:END:
- Memory management on the Python side is a non-issue
- Objects are auto-created, and then cleaned up by the garbage collector
- Most simple objects move into C by being assigned to the stack
- Sometimes, you need to manually assign heap space for larger or more
  complex objects

** Cython - using numpy
:PROPERTIES:
:CUSTOM_ID: cython---using-numpy
:END:
- You are able to use numpy data types, especially arrays
- This allows faster access and indexing
- */ndarray/* allows near direct C-like access to data within numpy
  arrays

** Cython - parallelization
:PROPERTIES:
:CUSTOM_ID: cython---parallelization
:END:
- You can write code that uses OpenMP threaded parallelization
- This side-steps the GIL, so you get true concurrent parallel code
- This means that you can't directly use Python objects, you need to
  move completely into C
- Your C compiler needs to support OpenMP (most do)

** Cython - C++ options
:PROPERTIES:
:CUSTOM_ID: cython---c-options
:END:
- There is also the ability to use C++
- The */cython.cimports.libcpp/* sub-module provides for lots of C++
  imports, like vectors
- This requires a native part of the module, specific to your
  infrastructure

** Cython - pure Python
:PROPERTIES:
:CUSTOM_ID: cython---pure-python
:END:
- You may not have the ability to use a C compiler, but still want some
  performance help
- Cython allows you to statically type your code, along with other
  cythonic functionality
- You can use an augmenting */.pxd/* file to cythonize your */.py/* file
- You can explicitly mark code as needing or not needing the GIL - this
  helps the interpreter run parallel threads

** Boost-y binding 1 - pybind11
:PROPERTIES:
:CUSTOM_ID: boost-y-binding-1---pybind11
:END:
- There is a */Boost.Python/* library - unfortunately you have to use
  */Boost/*
- */pybind11/* provides a much smaller and focused library to pull C++
  into Python
- Allows for C++ types, function calls, data structures, classes, etc

** pybind11 - installation
:PROPERTIES:
:CUSTOM_ID: pybind11---installation
:END:

- You can install */pybind11/* through pip:

#+begin_src sh
pip install pybind11
#+end_src

- You also need a C++ compiler, along with the development package for
  Python
- You also need a build system (cmake, meson, setuptools)

