Incorporating Other Languages into Python.tex
\begin{frame}[label=cython---annotation,fragile]{Cython - annotation}
 \begin{itemize}
\item Cython will compile pure Python
\item Using static typing will give a decent initial speedup
\item You can annotate so that it looks like
\end{itemize}

\begin{verbatim}
import cython

i: cython.int
j: cython.double
\end{verbatim}
\end{frame}
\begin{frame}[label=cython---different-notation,fragile]{Cython - different notation}
 Pure Python

\begin{verbatim}
def primes(nb_primes: cython.int):
    i: cython.int
    p: cython.int[1000]

    if nb_primes > 1000:
        nb_primes = 1000
    # Only if regular Python is running
    if not cython.compiled:
        # Make p work almost like a C array
        p = [0] * 1000

    len_p: cython.int = 0  # The current number of elements in p.
    n: cython.int = 2
    while len_p < nb_primes:
\end{verbatim}
\end{frame}
\begin{frame}[label={sec:org1a531ac},fragile]{Cython - different notation continued}
 Older Cython

\begin{verbatim}
def primes(int nb_primes):
    cdef int n, i, len_p
    cdef int[1000] p

    if nb_primes > 1000:
        nb_primes = 1000



    # The current number of elements in p.
    len_p = 0
    n = 2
    while len_p < nb_primes:
\end{verbatim}
\end{frame}
\begin{frame}[label=cython---usage,fragile]{Cython - usage}
 \begin{itemize}
\item The easiest way to build Cython code is to use setuptools
\end{itemize}

\begin{verbatim}
pip install cython
pip install setuptools
\end{verbatim}

\begin{itemize}
\item This way, you can use setuptools to build your Cython module
\item Files can use endings \emph{.pyx} or \emph{.py}
\end{itemize}
\end{frame}
\begin{frame}[label=cython---hello-world,fragile]{Cython - hello world}
 \begin{itemize}
\item We can start with the classic \alert{Hello World} in the file \alert{\emph{hello.pyx}}
\end{itemize}

\begin{verbatim}
def say_hello_to(name):
    print(f"Hello {name}!")
\end{verbatim}
\end{frame}
\begin{frame}[label=cython---setuptools,fragile]{Cython - setuptools}
 \begin{itemize}
\item To build it, we'll need a \emph{setup.py} script
\end{itemize}

\begin{verbatim}
from setuptools import setup
from Cython.Build import cythonize

setup(
    name='Hello World app',
    ext_modules=cythonize("hello.pyx"),
)
\end{verbatim}
\end{frame}
\begin{frame}[label=cython---building,fragile]{Cython - building}
 \begin{itemize}
\item To build it, you would use the command
\end{itemize}

\begin{verbatim}
python setup.py build_ext --inplace
\end{verbatim}

\begin{itemize}
\item Then you can use it with
\end{itemize}

\begin{verbatim}
from hello import say_hello_to
\end{verbatim}
\end{frame}
\begin{frame}[label=cython---basics]{Cython - basics}
\begin{itemize}
\item You can call C functions from libraries
\item You have the ability to use static types
\item Writing Python wrappers allows your Python code to use C libraries
\item Your Cython code gets compiled down to C
\end{itemize}
\end{frame}
\begin{frame}[label=cython---stdlib-functions,fragile]{Cython - stdlib functions}
 \begin{itemize}
\item You can import and use C functions from the standard library
\end{itemize}

\begin{verbatim}
from cython.cimports.libc.stdlib import atoi

@cython.cfunc
def parse_charptr_to_py_int(s: cython.p_char):
    assert s is not cython.NULL, "byte string value is NULL"
    return atoi(s)  # note: atoi() has no error detection!
\end{verbatim}
\end{frame}
\begin{frame}[label=cython---other-libraries]{Cython - other libraries}
\begin{itemize}
\item You can also import from other libraries, e.g.
\begin{itemize}
\item \alert{\emph{from cython.cimports.libc.math import sin}}
\end{itemize}
\item Some libraries (like math) are not automatically linked - you will
have to add linking information to your \alert{\emph{setup.py}} file
\end{itemize}
\end{frame}
\begin{frame}[label=cython---external-libraries]{Cython - external libraries}
\begin{itemize}
\item Using other external libraries isn't quite so seamless
\item You will need to write a \alert{\emph{.pxd}} file to wrap the details from the
header file for your external library
\item You then will need to write a Python wrapper class to encapsulate the
calls to the C code
\end{itemize}
\end{frame}
\begin{frame}[label=cython---cqueue-pxd-file,fragile]{Cython - cqueue pxd file}
 \begin{verbatim}
cdef extern from "c-algorithms/src/queue.h":
    ctypedef struct Queue:
        pass
    ctypedef void* QueueValue
    Queue* queue_new()
    void queue_free(Queue* queue)
    int queue_push_head(Queue* queue, QueueValue data)
    QueueValue  queue_pop_head(Queue* queue)
    QueueValue queue_peek_head(Queue* queue)
    int queue_push_tail(Queue* queue, QueueValue data)
    QueueValue queue_pop_tail(Queue* queue)
    QueueValue queue_peek_tail(Queue* queue)
    bint queue_is_empty(Queue* queue)
\end{verbatim}
\end{frame}
\begin{frame}[label=cython---wrapper-class-for-a-queue,fragile]{Cython - wrapper class for a queue}
 \begin{verbatim}
from cython.cimports import cqueue

@cython.cclass
class Queue:
    _c_queue: cython.pointer[cqueue.Queue]

    def __cinit__(self):
        self._c_queue = cqueue.queue_new()
\end{verbatim}
\end{frame}
\begin{frame}[label=cython---strings]{Cython - strings}
\begin{itemize}
\item Strings prove to be a bit of a mess
\item Cython supports 4 types: \emph{bytes}, \emph{str}, \emph{unicode} and \emph{basestring}
\item Involves a decoding/encoding step when going back and forth between
Python and C
\end{itemize}
\end{frame}
\begin{frame}[label=cython---memory-management]{Cython - memory management}
\begin{itemize}
\item Memory management on the Python side is a non-issue
\item Objects are auto-created, and then cleaned up by the garbage collector
\item Most simple objects move into C by being assigned to the stack
\item Sometimes, you need to manually assign heap space for larger or more
complex objects
\end{itemize}
\end{frame}
\begin{frame}[label=cython---using-numpy]{Cython - using numpy}
\begin{itemize}
\item You are able to use numpy data types, especially arrays
\item This allows faster access and indexing
\item \alert{\emph{ndarray}} allows near direct C-like access to data within numpy
arrays
\end{itemize}
\end{frame}
\begin{frame}[label=cython---parallelization]{Cython - parallelization}
\begin{itemize}
\item You can write code that uses OpenMP threaded parallelization
\item This side-steps the GIL, so you get true concurrent parallel code
\item This means that you can't directly use Python objects, you need to
move completely into C
\item Your C compiler needs to support OpenMP (most do)
\end{itemize}
\end{frame}
\begin{frame}[label=cython---c-options]{Cython - C++ options}
\begin{itemize}
\item There is also the ability to use C++
\item The \alert{\emph{cython.cimports.libcpp}} sub-module provides for lots of C++
imports, like vectors
\item This requires a native part of the module, specific to your
infrastructure
\end{itemize}
\end{frame}
\begin{frame}[label=cython---pure-python]{Cython - pure Python}
\begin{itemize}
\item You may not have the ability to use a C compiler, but still want some
performance help
\item Cython allows you to statically type your code, along with other
cythonic functionality
\item You can use an augmenting \alert{\emph{.pxd}} file to cythonize your \alert{\emph{.py}} file
\item You can explicitly mark code as needing or not needing the GIL - this
helps the interpreter run parallel threads
\end{itemize}
\end{frame}
\begin{frame}[label=boost-y-binding-1---pybind11]{Boost-y binding 1 - pybind11}
\begin{itemize}
\item There is a \alert{\emph{Boost.Python}} library - unfortunately you have to use
\alert{\emph{Boost}}
\item \alert{\emph{pybind11}} provides a much smaller and focused library to pull C++
into Python
\item Allows for C++ types, function calls, data structures, classes, etc
\end{itemize}
\end{frame}
\begin{frame}[label=pybind11---installation,fragile]{pybind11 - installation}
 \begin{itemize}
\item You can install \alert{\emph{pybind11}} through pip:
\end{itemize}

\begin{verbatim}
pip install pybind11
\end{verbatim}

\begin{itemize}
\item You also need a C++ compiler, along with the development package for
Python
\item You also need a build system (cmake, meson, setuptools)
\end{itemize}
\end{frame}
