Incorporating Other Languages into Python.org
** pybind11 - boilerplate
:PROPERTIES:
:CUSTOM_ID: pybind11---boilerplate
:END:

- You will likely need the following two lines at the top of any of your
  C++ source code files

#+begin_src C
#include <pybind11/pybind11.h>

namespace py = pybind11;
#+end_src

- Now you can add binding code to your C++ source files

** pybind11 - example file
:PROPERTIES:
:CUSTOM_ID: pybind11---example-file
:END:
#+begin_src C
#include <pybind11/pybind11.h>

int add(int i, int j) {
    return i + j;
}

PYBIND11_MODULE(example, m) {
    m.doc() = "pybind11 example plugin"; //optional module doc

    m.def("add", &add, "A function that adds two numbers");
}
#+end_src

** pybind11 - building
:PROPERTIES:
:CUSTOM_ID: pybind11---building
:END:

- Since */pybind11/* is based off of Boost, then it is also a
  header-only package
- This means that you don't need to link to any extra library
- Building is done through compilation

#+begin_src sh
$ c++ -O3 -Wall -shared -std=c++11 \\
   -fPIC $(python3 -m pybind11 --includes) example.cpp \\
   -o example$(python3-config --extension-suffix)
#+end_src

- You can now import the compiled module in Python the usual way

** pybind11 - keyword arguments
:PROPERTIES:
:CUSTOM_ID: pybind11---keyword-arguments
:END:

- In the exaple, the arguments are positional
- You need to add some code to allow for keyword arguments

#+begin_src C
m.def("add", &add, "A function which adds two numbers",
      py::arg("i"), py::arg("j"));
#+end_src

** pybind11 - exporting variables
:PROPERTIES:
:CUSTOM_ID: pybind11---exporting-variables
:END:
#+begin_src C
PYBIND11_MODULE(example, m) {
    m.attr("the_answer") = 42;
    py::object world = py::cast("World");
    m.attr("what") = world;
}
#+end_src

#+begin_src python
>>> import example
>>> example.the_answer
42
>>> example.what
'World'
#+end_src

** Boost-y binding 2 - Nanobind
:PROPERTIES:
:CUSTOM_ID: boost-y-binding-2---nanobind
:END:
- */nanobind/* is another Boost-y module, by the same person who wrote
  */pybind11/*
- */nanobind/* is even smaller, providing a subset of C++ functionality
  for your Python code

** nanobind - installation
:PROPERTIES:
:CUSTOM_ID: nanobind---installation
:END:

- Like everything else today, you can install using pip:

#+begin_src sh
pip install nanobind
#+end_src

- You will also need a C++ compiler
- */nanobind/* supports various build systems (cmake, meson, bazel)

** nanobind - basics
:PROPERTIES:
:CUSTOM_ID: nanobind---basics
:END:

- A basic module looks like

#+begin_src C
#include <nanobind/nanobind.h>

int add(int a, int b) { return a + b; }

NB_MODULE(my_ext, m) {
    m.def("add", &add);
}
#+end_src

- Building is through a */CMakeLists.txt/*

** nanobind - cmake general
:PROPERTIES:
:CUSTOM_ID: nanobind---cmake-general
:END:
#+begin_src sh
cmake_minimum_required(VERSION 3.15...3.27)
# Replace 'my_project' with the name of your project
project(my_project)

if (CMAKE_VERSION VERSION_LESS 3.18)
  set(DEV_MODULE Development)
else()
  set(DEV_MODULE Development.Module)
endif()

find_package(Python 3.8 COMPONENTS Interpreter
             ${DEV_MODULE} REQUIRED)
#+end_src

** nanobind - cmake specifics
:PROPERTIES:
:CUSTOM_ID: nanobind---cmake-specifics
:END:
#+begin_src sh
# Detect the installed nanobind package and import it
# into CMake
execute_process(
  COMMAND "${Python_EXECUTABLE}" -m nanobind --cmake_dir
  OUTPUT_STRIP_TRAILING_WHITESPACE OUTPUT_VARIABLE
  nanobind_ROOT)
find_package(nanobind CONFIG REQUIRED)
#+end_src

#+begin_src sh
nanobind_add_module(my_ext my_ext.cpp)
#+end_src

** nanobind - example
:PROPERTIES:
:CUSTOM_ID: nanobind---example
:END:
#+begin_src C
#include <nanobind/nanobind.h>

namespace nb = nanobind;
using namespace nb::literals;

int add(int a, int b = 1) { return a + b; }

NB_MODULE(my_ext, m) {
    m.def("add", &add, "a"_a, "b"_a = 1,
      "This function adds two numbers and increments if only
          one is provided.");
}
#+end_src

** CFFI
:PROPERTIES:
:CUSTOM_ID: cffi
:END:
- CFFI (C Foreign Function Interface) for Python is a more raw library
- Unlike systems like Cython, CFFI doesn't add extra syntax
- You just need to know C and Python

** CFFI - installation
:PROPERTIES:
:CUSTOM_ID: cffi---installation
:END:

- Installation can be done through pip:

#+begin_src sh
pip install cffi
#+end_src

- Includes a library (libffi) that can be messy to setup correctly on
  some platforms

** CFFI - basics
:PROPERTIES:
:CUSTOM_ID: cffi---basics
:END:
- You start with an */FFI()/* object
- You use the /cdef()/ method to provide C declarations
- You use the /set\textunderscore source()/ method to define the Python extension
  module, along with the associated C code
- You use the /compile()/ method to generate the compiled library
- You can then import this library like any other Python module

** CFFI - example
:PROPERTIES:
:CUSTOM_ID: cffi---example
:END:
#+begin_src python
from cffi import FFI
ffibuilder = FFI()

ffibuilder.cdef("""
    float pi_approx(int n);
""")

ffibuilder.set_source("_pi_cffi",
"""
     #include "pi.h"   // the C header of the library
""",
     libraries=['piapprox'])   # library name, for the linker

if __name__ == "__main__":
    ffibuilder.compile(verbose=True)
#+end_src

** CFFI - setup.py
:PROPERTIES:
:CUSTOM_ID: cffi---setup.py
:END:
#+begin_src python
from setuptools import setup

setup(
    ...
    setup_requires=["cffi>=1.0.0"],
    cffi_modules=["piapprox_build:ffibuilder"],
    install_requires=["cffi>=1.0.0"],
)
#+end_src

** CFFI - modes of use
:PROPERTIES:
:CUSTOM_ID: cffi---modes-of-use
:END:
- ABI - Application Binary Interface
- API - Application Programming Interface
- in-line - everything is setup everytime you import your code
- out-of-line - there is a separate step that compiles your code for
  import

** CFFI - ABI, in-line
:PROPERTIES:
:CUSTOM_ID: cffi---abi-in-line
:END:
#+begin_src python
from cffi import FFI
ffi = FFI()
ffi.cdef("""
    int printf(const char *format, ...);
""")
# loads the entire C namespace
C = ffi.dlopen(None)
# equivalent to C code: char arg[] = "world";
arg = ffi.new("char[]", b"world")
C.printf(b"hi there, %s.\n", arg)
#+end_src

** CFFI - API, out-of-line - 1
:PROPERTIES:
:CUSTOM_ID: cffi---api-out-of-line---1
:END:
#+begin_src python
from cffi import FFI
ffibuilder = FFI()

ffibuilder.cdef("int foo(int *, int *, int);")
ffibuilder.set_source("_example",
r"""
    static int foo(int *buffer_in,
           int *buffer_out, int x)
    {
    /* some algorithm that is seriously
    faster in C than in Python */
    }
""")
if __name__ == "__main__":
    ffibuilder.compile(verbose=True)
#+end_src

** CFFI - API, out-of-line - 2
:PROPERTIES:
:CUSTOM_ID: cffi---api-out-of-line---2
:END:
#+begin_src python
from _example import ffi, lib

buffer_in = ffi.new("int[]", 1000)
# initialize buffer_in here...

# easier to do all buffer allocations
# in Python and pass them to C,
# even for output-only arguments
buffer_out = ffi.new("int[]", 1000)

result = lib.foo(buffer_in, buffer_out, 1000)
#+end_src

** HPy
:PROPERTIES:
:CUSTOM_ID: hpy
:END:
- Technically still alpha (version 0.9.0)
- An attempt at modernizing how to incorporate C into Python
- It is much more like the C/API

** HPy - installation
:PROPERTIES:
:CUSTOM_ID: hpy---installation
:END:

- Installation is through pip:

#+begin_src sh
pip install hpy
#+end_src

- You need a C compiler
- You actually write C source code and compile it into a library that
  can be imported into Python

