Incorporating Other Languages into Python.tex
\begin{frame}[label=pybind11---boilerplate,fragile]{pybind11 - boilerplate}
 \begin{itemize}
\item You will likely need the following two lines at the top of any of your
C++ source code files
\end{itemize}

\begin{verbatim}
#include <pybind11/pybind11.h>

namespace py = pybind11;
\end{verbatim}

\begin{itemize}
\item Now you can add binding code to your C++ source files
\end{itemize}
\end{frame}
\begin{frame}[label=pybind11---example-file,fragile]{pybind11 - example file}
 \begin{verbatim}
#include <pybind11/pybind11.h>

int add(int i, int j) {
    return i + j;
}

PYBIND11_MODULE(example, m) {
    m.doc() = "pybind11 example plugin"; //optional module doc

    m.def("add", &add, "A function that adds two numbers");
}
\end{verbatim}
\end{frame}
\begin{frame}[label=pybind11---building,fragile]{pybind11 - building}
 \begin{itemize}
\item Since \alert{\emph{pybind11}} is based off of Boost, then it is also a
header-only package
\item This means that you don't need to link to any extra library
\item Building is done through compilation
\end{itemize}

\begin{verbatim}
$ c++ -O3 -Wall -shared -std=c++11 \\
   -fPIC $(python3 -m pybind11 --includes) example.cpp \\
   -o example$(python3-config --extension-suffix)
\end{verbatim}

\begin{itemize}
\item You can now import the compiled module in Python the usual way
\end{itemize}
\end{frame}
\begin{frame}[label=pybind11---keyword-arguments,fragile]{pybind11 - keyword arguments}
 \begin{itemize}
\item In the exaple, the arguments are positional
\item You need to add some code to allow for keyword arguments
\end{itemize}

\begin{verbatim}
m.def("add", &add, "A function which adds two numbers",
      py::arg("i"), py::arg("j"));
\end{verbatim}
\end{frame}
\begin{frame}[label=pybind11---exporting-variables,fragile]{pybind11 - exporting variables}
 \begin{verbatim}
PYBIND11_MODULE(example, m) {
    m.attr("the_answer") = 42;
    py::object world = py::cast("World");
    m.attr("what") = world;
}
\end{verbatim}

\begin{verbatim}
>>> import example
>>> example.the_answer
42
>>> example.what
'World'
\end{verbatim}
\end{frame}
\begin{frame}[label=boost-y-binding-2---nanobind]{Boost-y binding 2 - Nanobind}
\begin{itemize}
\item \alert{\emph{nanobind}} is another Boost-y module, by the same person who wrote
\alert{\emph{pybind11}}
\item \alert{\emph{nanobind}} is even smaller, providing a subset of C++ functionality
for your Python code
\end{itemize}
\end{frame}
\begin{frame}[label=nanobind---installation,fragile]{nanobind - installation}
 \begin{itemize}
\item Like everything else today, you can install using pip:
\end{itemize}

\begin{verbatim}
pip install nanobind
\end{verbatim}

\begin{itemize}
\item You will also need a C++ compiler
\item \alert{\emph{nanobind}} supports various build systems (cmake, meson, bazel)
\end{itemize}
\end{frame}
\begin{frame}[label=nanobind---basics,fragile]{nanobind - basics}
 \begin{itemize}
\item A basic module looks like
\end{itemize}

\begin{verbatim}
#include <nanobind/nanobind.h>

int add(int a, int b) { return a + b; }

NB_MODULE(my_ext, m) {
    m.def("add", &add);
}
\end{verbatim}

\begin{itemize}
\item Building is through a \alert{\emph{CMakeLists.txt}}
\end{itemize}
\end{frame}
\begin{frame}[label=nanobind---cmake-general,fragile]{nanobind - cmake general}
 \begin{verbatim}
cmake_minimum_required(VERSION 3.15...3.27)
# Replace 'my_project' with the name of your project
project(my_project)

if (CMAKE_VERSION VERSION_LESS 3.18)
  set(DEV_MODULE Development)
else()
  set(DEV_MODULE Development.Module)
endif()

find_package(Python 3.8 COMPONENTS Interpreter
             ${DEV_MODULE} REQUIRED)
\end{verbatim}
\end{frame}
\begin{frame}[label=nanobind---cmake-specifics,fragile]{nanobind - cmake specifics}
 \begin{verbatim}
# Detect the installed nanobind package and import it
# into CMake
execute_process(
  COMMAND "${Python_EXECUTABLE}" -m nanobind --cmake_dir
  OUTPUT_STRIP_TRAILING_WHITESPACE OUTPUT_VARIABLE
  nanobind_ROOT)
find_package(nanobind CONFIG REQUIRED)
\end{verbatim}

\begin{verbatim}
nanobind_add_module(my_ext my_ext.cpp)
\end{verbatim}
\end{frame}
\begin{frame}[label=nanobind---example,fragile]{nanobind - example}
 \begin{verbatim}
#include <nanobind/nanobind.h>

namespace nb = nanobind;
using namespace nb::literals;

int add(int a, int b = 1) { return a + b; }

NB_MODULE(my_ext, m) {
    m.def("add", &add, "a"_a, "b"_a = 1,
      "This function adds two numbers and increments if only
          one is provided.");
}
\end{verbatim}
\end{frame}
\begin{frame}[label=cffi]{CFFI}
\begin{itemize}
\item CFFI (C Foreign Function Interface) for Python is a more raw library
\item Unlike systems like Cython, CFFI doesn't add extra syntax
\item You just need to know C and Python
\end{itemize}
\end{frame}
\begin{frame}[label=cffi---installation,fragile]{CFFI - installation}
 \begin{itemize}
\item Installation can be done through pip:
\end{itemize}

\begin{verbatim}
pip install cffi
\end{verbatim}

\begin{itemize}
\item Includes a library (libffi) that can be messy to setup correctly on
some platforms
\end{itemize}
\end{frame}
\begin{frame}[label=cffi---basics]{CFFI - basics}
\begin{itemize}
\item You start with an \alert{\emph{FFI()}} object
\item You use the \emph{cdef()} method to provide C declarations
\item You use the \emph{set\textunderscore source()} method to define the Python extension
module, along with the associated C code
\item You use the \emph{compile()} method to generate the compiled library
\item You can then import this library like any other Python module
\end{itemize}
\end{frame}
\begin{frame}[label=cffi---example,fragile]{CFFI - example}
 \begin{verbatim}
from cffi import FFI
ffibuilder = FFI()

ffibuilder.cdef("""
    float pi_approx(int n);
""")

ffibuilder.set_source("_pi_cffi",
"""
     #include "pi.h"   // the C header of the library
""",
     libraries=['piapprox'])   # library name, for the linker

if __name__ == "__main__":
    ffibuilder.compile(verbose=True)
\end{verbatim}
\end{frame}
\begin{frame}[label=cffi---setup.py,fragile]{CFFI - setup.py}
 \begin{verbatim}
from setuptools import setup

setup(
    ...
    setup_requires=["cffi>=1.0.0"],
    cffi_modules=["piapprox_build:ffibuilder"],
    install_requires=["cffi>=1.0.0"],
)
\end{verbatim}
\end{frame}
\begin{frame}[label=cffi---modes-of-use]{CFFI - modes of use}
\begin{itemize}
\item ABI - Application Binary Interface
\item API - Application Programming Interface
\item in-line - everything is setup everytime you import your code
\item out-of-line - there is a separate step that compiles your code for
import
\end{itemize}
\end{frame}
\begin{frame}[label=cffi---abi-in-line,fragile]{CFFI - ABI, in-line}
 \begin{verbatim}
from cffi import FFI
ffi = FFI()
ffi.cdef("""
    int printf(const char *format, ...);
""")
# loads the entire C namespace
C = ffi.dlopen(None)
# equivalent to C code: char arg[] = "world";
arg = ffi.new("char[]", b"world")
C.printf(b"hi there, %s.\n", arg)
\end{verbatim}
\end{frame}
\begin{frame}[label=cffi---api-out-of-line---1,fragile]{CFFI - API, out-of-line - 1}
 \begin{verbatim}
from cffi import FFI
ffibuilder = FFI()

ffibuilder.cdef("int foo(int *, int *, int);")
ffibuilder.set_source("_example",
r"""
    static int foo(int *buffer_in,
           int *buffer_out, int x)
    {
    /* some algorithm that is seriously
    faster in C than in Python */
    }
""")
if __name__ == "__main__":
    ffibuilder.compile(verbose=True)
\end{verbatim}
\end{frame}
\begin{frame}[label=cffi---api-out-of-line---2,fragile]{CFFI - API, out-of-line - 2}
 \begin{verbatim}
from _example import ffi, lib

buffer_in = ffi.new("int[]", 1000)
# initialize buffer_in here...

# easier to do all buffer allocations
# in Python and pass them to C,
# even for output-only arguments
buffer_out = ffi.new("int[]", 1000)

result = lib.foo(buffer_in, buffer_out, 1000)
\end{verbatim}
\end{frame}
\begin{frame}[label=hpy]{HPy}
\begin{itemize}
\item Technically still alpha (version 0.9.0)
\item An attempt at modernizing how to incorporate C into Python
\item It is much more like the C/API
\end{itemize}
\end{frame}
\begin{frame}[label=hpy---installation,fragile]{HPy - installation}
 \begin{itemize}
\item Installation is through pip:
\end{itemize}

\begin{verbatim}
pip install hpy
\end{verbatim}

\begin{itemize}
\item You need a C compiler
\item You actually write C source code and compile it into a library that
can be imported into Python
\end{itemize}
\end{frame}
