Incorporating Other Languages into Python.org
** swig - not just for Python
:PROPERTIES:
:CUSTOM_ID: swig---not-just-for-python
:END:
- */swig/* (Simplified Wrapper and Interface Generator) builds scripting
  language interfaces to C and C++
- Works for languages like Python, Tcl, Perl and Guile

** swig - installation
:PROPERTIES:
:CUSTOM_ID: swig---installation
:END:
- swig is not part of the Python community
- You can install it from source
- Check your platform package manager to see if it is already there

** swig - basics
:PROPERTIES:
:CUSTOM_ID: swig---basics
:END:
- You write the C source code in its own file
- You create an interface file to declare what C functions are available
- Calling */swig/* generates the needed wrapper C code
- You then need to compile the C ocde and link it together into a shared
  library
- This can then be imported into Python

** pyO3 - a Rust option
:PROPERTIES:
:CUSTOM_ID: pyo3---a-rust-option
:END:
- Rust is more of a platform than C or C++
- This requires more tooling to develop code
- pyO3 can be used to call Rust in Python, or Python in Rust
- Packages managed at https://crates.io
- Searching for "science" gives 656 crates, environment is still being
  built out

** pyO3 - installation
:PROPERTIES:
:CUSTOM_ID: pyo3---installation
:END:

- The easiest way is to use */maturin/* inside a virtual environment to
  initialize a project

#+begin_src sh
pip install maturin
maturin init --bindings pyo3
#+end_src

- This creates several project files, the most important of which are
  */Cargo.toml/* and */src/lib.rs/*

** pyO3 - Cargo.toml
:PROPERTIES:
:CUSTOM_ID: pyo3---cargo.toml
:END:
#+begin_src rust
[package]
name = "string_sum"
version = "0.1.0"
edition = "2021"

[lib]
# The name of the native library.
name = "string_sum"
# "cdylib" is necessary to produce a shared library for
# Python to import from.
crate-type = ["cdylib"]

[dependencies]
pyo3 = { version = "0.25.0", features = ["extension-module"] }
#+end_src

** pyO3 - lib.rs
:PROPERTIES:
:CUSTOM_ID: pyo3---lib.rs
:END:
#+begin_src rust
use pyo3::prelude::*;
/// Formats the sum of two numbers as string.
#[pyfunction]
fn sum_as_string(a: usize, b: usize) -> PyResult<String> {
    Ok((a + b).to_string())
}
/// A Python module implemented in Rust.
/// The name of this function must match
/// the `lib.name` setting in the `Cargo.toml`,
/// else Python will not be able to import the module.
#[pymodule]
fn string_sum(m: &Bound<'_, PyModule>) -> PyResult<()> {
    m.add_function(wrap_pyfunction!(sum_as_string, m)?)?;
    Ok(())
}
#+end_src

** pyO3 - building
:PROPERTIES:
:CUSTOM_ID: pyo3---building
:END:

- To build code, use

#+begin_src sh
maturin develop
#+end_src

- This will build the library and install it into the virtual
  environment that we are currently in

** pyO3 - functions
:PROPERTIES:
:CUSTOM_ID: pyo3---functions
:END:
- As we saw in a previous slide, you can decorate a function in Rust so
  that it can be used in Python
- */pyO3/* actually creates a C wrapper that acts as an intermediate
  layer between Rust and Python
- Most of the same concerns and functionalities from solutions like
  Cython also exist here
- The same ability to avoid the GIL is provided through */pyO3/*

** pyO3 - example
:PROPERTIES:
:CUSTOM_ID: pyo3---example
:END:
#+begin_src rust
use pyo3::prelude::*;

#[pyfunction]
fn double(x: usize) -> usize {
    x * 2
}

#[pymodule]
fn my_extension(m: &Bound<'_, PyModule>) -> PyResult<()> {
    m.add_function(wrap_pyfunction!(double, m)?)
}
#+end_src

** pyO3 - shorthand
:PROPERTIES:
:CUSTOM_ID: pyo3---shorthand
:END:
#+begin_src rust
use pyo3::prelude::*;

#[pymodule]
fn my_extension(m: &Bound<'_, PyModule>) -> PyResult<()> {
    #[pyfn(m)]
    fn double(x: usize) -> usize {
    x * 2
    }

    Ok(())
}
#+end_src

** pyO3 - parallelism
:PROPERTIES:
:CUSTOM_ID: pyo3---parallelism
:END:
- Since the Rust code is running outside of Python, it can take
  advantage of true parallelism
- There is a call (*/Python::allow\textunderscore threads/*) that temporarily releases
  the GIL and allows other threads within Python to continue running

** Conclusion
:PROPERTIES:
:CUSTOM_ID: conclusion
:END:
- If you have started your project in Python, there are lots of ways of
  incrementally adding other languages for performance
- If you have started in your code in C/C++ or some other language,
  there are lots of options to wrap your code in Python to make it
  easier to share

** Resources
:PROPERTIES:
:CUSTOM_ID: resources
:END:
- https://numba.pydata.org
- https://cython.org
- https://github.com/pybind/pybind11
- https://github.com/wjakob/nanobind
- https://github.com/python-cffi/cffi
- https://hpyproject.org
- https://www.swig.org
- https://github.com/PyO3/pyo3
