Incorporating Other Languages into Python.tex
\begin{frame}[label=swig---not-just-for-python]{swig - not just for Python}
\begin{itemize}
\item \alert{\emph{swig}} (Simplified Wrapper and Interface Generator) builds scripting
language interfaces to C and C++
\item Works for languages like Python, Tcl, Perl and Guile
\end{itemize}
\end{frame}
\begin{frame}[label=swig---installation]{swig - installation}
\begin{itemize}
\item swig is not part of the Python community
\item You can install it from source
\item Check your platform package manager to see if it is already there
\end{itemize}
\end{frame}
\begin{frame}[label=swig---basics]{swig - basics}
\begin{itemize}
\item You write the C source code in its own file
\item You create an interface file to declare what C functions are available
\item Calling \alert{\emph{swig}} generates the needed wrapper C code
\item You then need to compile the C ocde and link it together into a shared
library
\item This can then be imported into Python
\end{itemize}
\end{frame}
\begin{frame}[label=pyo3---a-rust-option]{pyO3 - a Rust option}
\begin{itemize}
\item Rust is more of a platform than C or C++
\item This requires more tooling to develop code
\item pyO3 can be used to call Rust in Python, or Python in Rust
\item Packages managed at \url{https://crates.io}
\item Searching for ``science'' gives 656 crates, environment is still being
built out
\end{itemize}
\end{frame}
\begin{frame}[label=pyo3---installation,fragile]{pyO3 - installation}
 \begin{itemize}
\item The easiest way is to use \alert{\emph{maturin}} inside a virtual environment to
initialize a project
\end{itemize}

\begin{verbatim}
pip install maturin
maturin init --bindings pyo3
\end{verbatim}

\begin{itemize}
\item This creates several project files, the most important of which are
\alert{\emph{Cargo.toml}} and \alert{\emph{src/lib.rs}}
\end{itemize}
\end{frame}
\begin{frame}[label=pyo3---cargo.toml,fragile]{pyO3 - Cargo.toml}
 \begin{verbatim}
[package]
name = "string_sum"
version = "0.1.0"
edition = "2021"

[lib]
# The name of the native library.
name = "string_sum"
# "cdylib" is necessary to produce a shared library for
# Python to import from.
crate-type = ["cdylib"]

[dependencies]
pyo3 = { version = "0.25.0", features = ["extension-module"] }
\end{verbatim}
\end{frame}
\begin{frame}[label=pyo3---lib.rs,fragile]{pyO3 - lib.rs}
 \begin{verbatim}
use pyo3::prelude::*;
/// Formats the sum of two numbers as string.
#[pyfunction]
fn sum_as_string(a: usize, b: usize) -> PyResult<String> {
    Ok((a + b).to_string())
}
/// A Python module implemented in Rust.
/// The name of this function must match
/// the `lib.name` setting in the `Cargo.toml`,
/// else Python will not be able to import the module.
#[pymodule]
fn string_sum(m: &Bound<'_, PyModule>) -> PyResult<()> {
    m.add_function(wrap_pyfunction!(sum_as_string, m)?)?;
    Ok(())
}
\end{verbatim}
\end{frame}
\begin{frame}[label=pyo3---building,fragile]{pyO3 - building}
 \begin{itemize}
\item To build code, use
\end{itemize}

\begin{verbatim}
maturin develop
\end{verbatim}

\begin{itemize}
\item This will build the library and install it into the virtual
environment that we are currently in
\end{itemize}
\end{frame}
\begin{frame}[label=pyo3---functions]{pyO3 - functions}
\begin{itemize}
\item As we saw in a previous slide, you can decorate a function in Rust so
that it can be used in Python
\item \alert{\emph{pyO3}} actually creates a C wrapper that acts as an intermediate
layer between Rust and Python
\item Most of the same concerns and functionalities from solutions like
Cython also exist here
\item The same ability to avoid the GIL is provided through \alert{\emph{pyO3}}
\end{itemize}
\end{frame}
\begin{frame}[label=pyo3---example,fragile]{pyO3 - example}
 \begin{verbatim}
use pyo3::prelude::*;

#[pyfunction]
fn double(x: usize) -> usize {
    x * 2
}

#[pymodule]
fn my_extension(m: &Bound<'_, PyModule>) -> PyResult<()> {
    m.add_function(wrap_pyfunction!(double, m)?)
}
\end{verbatim}
\end{frame}
\begin{frame}[label=pyo3---shorthand,fragile]{pyO3 - shorthand}
 \begin{verbatim}
use pyo3::prelude::*;

#[pymodule]
fn my_extension(m: &Bound<'_, PyModule>) -> PyResult<()> {
    #[pyfn(m)]
    fn double(x: usize) -> usize {
    x * 2
    }

    Ok(())
}
\end{verbatim}
\end{frame}
\begin{frame}[label=pyo3---parallelism]{pyO3 - parallelism}
\begin{itemize}
\item Since the Rust code is running outside of Python, it can take
advantage of true parallelism
\item There is a call (\alert{\emph{Python::allow\textunderscore threads}}) that temporarily releases
the GIL and allows other threads within Python to continue running
\end{itemize}
\end{frame}
\begin{frame}[label=conclusion]{Conclusion}
\begin{itemize}
\item If you have started your project in Python, there are lots of ways of
incrementally adding other languages for performance
\item If you have started in your code in C/C++ or some other language,
there are lots of options to wrap your code in Python to make it
easier to share
\end{itemize}
\end{frame}
\begin{frame}[label=resources]{Resources}
\begin{itemize}
\item \url{https://numba.pydata.org}
\item \url{https://cython.org}
\item \url{https://github.com/pybind/pybind11}
\item \url{https://github.com/wjakob/nanobind}
\item \url{https://github.com/python-cffi/cffi}
\item \url{https://hpyproject.org}
\item \url{https://www.swig.org}
\item \url{https://github.com/PyO3/pyo3}
\end{itemize}
\end{frame}
\end{document}
